app/views/comments/create.js.erb

$( "#comment_link_<%=@comment.status_id%>" ).html("<%= pluralize(@comment.status.comments.size,'comment')%>");
---
SELECT  "statuses".* FROM "statuses"  WHERE "statuses"."id" = ? LIMIT 1  [["id", 13]]
SELECT "comments".* FROM "comments"  WHERE "comments"."status_id" = ?  [["status_id", 13]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."status_id" = ?  [["status_id", 13]]