app/views/statuses/_form_status_show.html.erb

        <div class="col-md-1"><%=image_tag status.user.avatar.url(:thumb)%></div>
        <div class="col-md-11"><h4><%=link_to "#{status.user.first_name} #{status.user.last_name}", profil_path %></h4></div>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  </div>
    <%=link_to pluralize(status.comments.size,'comment'), status_path(status.id), :id=>"comment_link_#{status.id}" %>
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."status_id" = ?  [["status_id", 20]]