app/views/statuses/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
        <div class="col-md-1"><%=image_tag @status.user.avatar.url(:thumb)%></div>
        <div class="col-md-11"><h4><%=link_to "#{@status.user.first_name} #{@status.user.last_name}", profil_path %></h4></div>

SELECT "comments".* FROM "comments"  WHERE "comments"."status_id" = ?  [["status_id", 13]]
---
  </div>
  <% comments = @status.comments.all%>