app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"   ORDER BY comments.created_at desc
---
  def index
    @comments = Comment.all.order("comments.created_at desc")

INSERT INTO "comments" ("comment", "created_at", "status_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "ehehe"], ["created_at", "2014-10-07 03:13:32.682558"], ["status_id", 13], ["updated_at", "2014-10-07 03:13:32.682558"], ["user_id", 1]]
---
  def create
    @comment = Comment.new(params.require(:comment).permit(:comment, :user_id, :status_id))


    @comment.save

SELECT "comments".* FROM "comments"  WHERE "comments"."user_id" = 2
---
  def show
    @comment = Comment.where(user_id: params[:id])

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "comments" SET "comment" = ?, "updated_at" = ? WHERE "comments"."id" = 1  [["comment", "1000"], ["updated_at", "2014-10-05 16:45:20.417980"]]
---
  def update
    @comment = Comment.find(params[:id])
    if @comment.update(params.require(:comment).permit(:comment))