app/controllers/statuses_controller.rb

SELECT  "statuses".* FROM "statuses"   ORDER BY "statuses"."id" DESC LIMIT 1
---
  def index
    @statuses = Status.all.order("statuses.created_at desc")

INSERT INTO "statuses" ("created_at", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-06 16:54:34.454969"], ["status", "a"], ["updated_at", "2014-10-06 16:54:34.454969"], ["user_id", 1]]
---
  def create
    @status = Status.new(params.require(:status).permit(:status))
    @status.user_id = current_user.id
    @status.save

SELECT  "statuses".* FROM "statuses"  WHERE "statuses"."id" = ? LIMIT 1  [["id", 12]]
---
  def show
    @status = Status.find(params[:id])