app/controllers/users_controller.rb

  def update
    if current_user.update_attributes(params.require(:user).permit(:first_name, :last_name, :contrycode, :phone_number, :avatar))
---
UPDATE "users" SET "contrycode" = ?, "last_name" = ?, "phone_number" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["contrycode", "+62"], ["last_name", "testing"], ["phone_number", "123456789123"], ["updated_at", "2014-10-11 05:20:20.335953"]]